---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailAngledJoinOption.AddVerticalOrHorizontalSegments
enum: Autodesk.Revit.DB.Architecture.RailAngledJoinOption
source: html/6434d9f0-b063-04d7-9b6f-9724f8522351.htm
---
# Autodesk.Revit.DB.Architecture.RailAngledJoinOption.AddVerticalOrHorizontalSegments

Add vertical or horizontal segments.